import React from "react";
import classes from "./accessibility.module.css";

export default function Accessibility() {
  return (
    <div className={classes.pageContainer}>
      <h1 className={classes.pageTitle}>הצהרת נגישות</h1>
      <div className={classes.pageContent}>
        <p>
          החברה פועלת ומקדמת את נושא הנגישות על-פי המוגדר בחקיקת הנגישות ורואה
          בלקוחות עם מוגבלות לקוחות שווי זכויות, הזכאים ליהנות מנגישות מלאה באתר
          החברה.
        </p>
        <p>
          מטרתו של חלק זה באתר הינו יידוע בדבר הסדרי הנגישות של החברה. יש לציין
          כי במשרדי החברה לא מתקבלת קבלת קהל.
        </p>

        <h2>יידוע כלל עובדי החברה</h2>
        <p>
          כלל עובדי המשרד יודעו אודות חובות החוק תוך דגש על איסור אפליה, מתן
          שירות שוויוני בסביבה מכילה, ועל הסדרי הנגישות של החברה ללקוחות עם
          מוגבלות.
        </p>

        <h2>הדרכות שירות לעובדים</h2>
        <p>
          עובדי השירות הוכשרו במתן שירות לאנשים עם מוגבלויות כמו גם מנהלי
          המוקדים.
        </p>

        <h2>מוקדי שירות טלפוני</h2>
        <p>
          מוקדי השירות שלנו זמינים ונגישים עבור כלל לקוחותינו, לרבות אנשים עם
          מוגבלות. המענה הקולי מותאם והינו ללא מוזיקת רקע, בקצב איטי ובשפה
          פשוטה.
        </p>

        <h2>מסירת מידע בפורמט נגיש</h2>
        <p>
          החברה מעמידה עבור לקוחותיה אפשרות לקבלת מידע בפורמטים נגישים. מסירת
          המידע הינה ללא עלות ומיועדת עבור אנשים עם מוגבלות. לפניות ומידע בנושא
          נגישות ניתן ליצור קשר עם אחד מרכזי הנגישות של החברה כפי שמופיע בהמשך.
        </p>

        <h2>נגישות באינטרנט</h2>
        <p>
          התאמות הנגישות באתר בוצעו בהתאם לסימן ג': שירותי האינטרנט בתקנות
          שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות לשירות) התשע"ג 2013,
          לתקן הישראלי ת"י 5568 המבוסס על הנחיות WCAG 2.0, האתר הונגש לרמה AA
          ובכפוף לשינויים והתאמות שבוצעו במסמך התקן הישראלי.
        </p>
        <p>
          באתר מוצב תפריט הנגשה. לחיצה על התפריט מאפשרת פתיחת כפתורי ההנגשה.
          לאחר בחירת נושא בתפריט יש להמתין לטעינת הדף. התוכנה פועלת בדפדפנים
          הפופולריים: Chrome, Firefox, Explorer 10+, Safari, Opera. הגלישה במצב
          נגישות מומלצת בדפדפן הנפוץ בקרב הגולשים: כרום. בדפדפנים אחרים יתכנו אי
          תאימות עקב אי תאימות הדפדפנים עצמם לתקן.
        </p>

        <h2>מה בתפריט?</h2>
        <ul>
          <li>
            טקסט: שינוי גודל פונט, שינוי סוג פונט לקריא יותר, הגדלת הסמן ושינוי
            צבעו.
          </li>
          <li>
            צבעים: שינוי ניגודיות צבעים (רקע כהה/בהיר), התאמת האתר לעיוורי
            צבעים.
          </li>
          <li>
            תצוגה: הגדלת התצוגה לכ-200%, עצירת אלמנטים נעים וחסימת הבהובים.
          </li>
          <li>הדגשה: הדגשת קישורים וכותרות באתר.</li>
          <li>
            התמצאות: ניווט מלא ע"י מקלדת והתאמת האתר עבור טכנולוגיות מסייעות
            NVDA.
          </li>
        </ul>

        <p className={classes.updateDate}>הצהרת הנגישות עודכנה ביום 28.7.26</p>
      </div>
    </div>
  );
}
